## Day 20 â€“Python MySQL Join

### Excercise

#### 1) Create an Employee Table with employee name,employee ID & Salary

In [29]:
import mysql.connector

In [30]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'password'
)
db = mydb.cursor()

In [7]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'password',
    database = 'Employee'
)
db = mydb.cursor()
db.execute('CREATE TABLE employee (emp_id INT PRIMARY KEY, emp_name VARCHAR(255), salary DOUBLE)')

In [9]:
db = mydb.cursor()
sql = 'INSERT INTO employee(emp_id,emp_name,salary)VALUES(%s,%s,%s)'
value = [(101,'Hameed',20000),
         (102,'Jawa',500000),(103,'Usama',50000),(104,'Raju',8000),(105,'Prakash',10000),
         (106,'Tim',15000),(107,'Irfan',20000),(108,'Varunka',25000),(109,'Diya',12000),
         (110,'Albin',30000)]
db.executemany(sql,value)

mydb.commit()

print(db.rowcount, 'item inserted')

10 item inserted

In [32]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'password',
    database = 'Employee'
)
db = mydb.cursor()

db.execute("SELECT * FROM employee")

res = db.fetchall()

for i in res:
    print(i)

(101, 'Hameed', 20000.0)
(102, 'Jawa', 500000.0)
(103, 'Usama', 50000.0)
(104, 'Raju', 8000.0)
(105, 'Prakash', 10000.0)
(106, 'Tim', 15000.0)
(107, 'Irfan', 20000.0)
(108, 'Varunka', 25000.0)
(109, 'Diya', 12000.0)
(110, 'Albin', 30000.0)

#### a.	Write a query to get the maximum and minimum salary from employees table

In [34]:
#max salary

db = mydb.cursor()

db.execute('SELECT MAX(salary) FROM employee')

res = db.fetchone()

for i in res:
    print('Maximum Salary : ',i)

Maximum Salary :  500000.0

In [35]:
#min salary

db = mydb.cursor()

db.execute('SELECT MIN(salary) FROM employee')

res = db.fetchone()

for i in res:
    print('Minimum Salary : ',i)

Minimum Salary :  8000.0

#### b.	Write a query to get the number of employees working with the company

In [36]:
db = mydb.cursor()

db.execute('SELECT COUNT(emp_id) FROM employee')

res = db.fetchone()

for i in res:
    print('Total Number Of Workers: ',i)

Total Number Of Workers:  10

#### c.	Write a query to get the first 3 characters of first name from employees table

In [37]:
db = mydb.cursor()

db.execute('SELECT SUBSTRING(emp_name, 1, 3 ) FROM employee;')

res = db.fetchall()

for i in res:
    print(i)

('Ham',)
('Jaw',)
('Usa',)
('Raj',)
('Pra',)
('Tim',)
('Irf',)
('Var',)
('Diy',)
('Alb',)